; domain
(define (domain blocks)

    (:requirements :strips :typing)

    (:types block)

    (:predicates 
        (on ?x - block ?y - block)
        (ontable ?x - block)
        (clear ?x - block)
        (handempty)
        (holding ?x - block)
    )

    (:action pick-up
        :parameters (?x - block)
        :precondition (and (clear ?x) (ontable ?x) (handempty))
        :effect (and (not (ontable ?x)) (not (clear ?x)) (not (handempty)) (holding ?x))
    )

    (:action put-down
        :parameters (?x - block)
        :precondition (holding ?x)
        :effect (and (not (holding ?x)) (clear ?x) (handempty) (ontable ?x))
    )

    (:action stack
        :parameters (?x - block ?y - block)
        :precondition (and (holding ?x) (clear ?y))
        :effect (and (not (holding ?x)) (not (clear ?y)) (clear ?x) (handempty) (on ?x ?y))
    )

    (:action unstack
        :parameters (?x - block ?y - block)
        :precondition (and (on ?x ?y) (clear ?x) (handempty))
        :effect (and (holding ?x) (clear ?y) (not (clear ?x)) (not (handempty)) (not (on ?x ?y)))
    )
)

; problem
(define (problem blocks-prob-4)
  (:domain blocks)

  (:objects
    b1 - block
    b2 - block
    b3 - block
    b4 - block
    b5 - block
    b6 - block
    b7 - block
  )

  (:init
    (ontable b6)
    (on b3 b6)
    (on b5 b3)
    (ontable b4)
    (on b2 b4)
    (ontable b1)
    (on b7 b1)
    (clear b5)
    (clear b2)
    (clear b7)
    (handempty)
  )

  (:goal (and
    (ontable b6)
    (on b7 b6)
    (ontable b5)
    (on b2 b5)
    (ontable b4)
    (on b1 b4)
    (ontable b3)
  ))
)

; plan
1. (unstack b5 b3)
   deleted: (clear b5) (handempty) (on b5 b3)
   added: (holding b5) (clear b3)
   goals met: 2 of 7
2. (put-down b5)
   deleted: (holding b5)
   added: (clear b5) (handempty) (ontable b5)
   goals met: 3 of 7
3. (unstack b3 b6)
   deleted: (clear b3) (handempty) (on b3 b6)
   added: (holding b3) (clear b6)
   goals met: 3 of 7
4. (put-down b3)
   deleted: (holding b3)
   added: (clear b3) (handempty) (ontable b3)
   goals met: 4 of 7
5. (unstack b2 b4)
   deleted: (clear b2) (handempty) (on b2 b4)
   added: (holding b2) (clear b4)
   goals met: 4 of 7
6. (stack b2 b5)
   deleted: (holding b2) (clear b5)
   added: (clear b2) (handempty) (on b2 b5)
   goals met: 5 of 7
7. (unstack b7 b1)
   deleted: (clear b7) (handempty) (on b7 b1)
   added: (holding b7) (clear b1)
   goals met: 5 of 7
8. (stack b7 b6)
   deleted: (holding b7) (clear b6)
   added: (clear b7) (handempty) (on b7 b6)
   goals met: 6 of 7
9. (pick-up b1)
   deleted: (ontable b1) (clear b1) (handempty)
   added: (holding b1)
   goals met: 6 of 7
10. (stack b1 b4)
   deleted: (holding b1) (clear b4)
   added: (clear b1) (handempty) (on b1 b4)
   goals met: 7 of 7
